/*---------------------------------------------------------------------
                    hardwar.h文件 硬件抽取层  
  作者：Computer-lov     创建日期:2004.11.12    最后修改日期:2004.11.21
  版本：1.0
-----------------------------------------------------------------------*/



#ifndef __HARDWAR_H__
#define __HARDWAR_H__

#include <reg51.H>	

/*---------------------------------------------------------
                   LCD数据、控制口定义
---------------------------------------------------------*/
#define LCD_DATA P1        //LCD的数据口

sbit LCD_BUSY=LCD_DATA^7;  //LCD忙信号位

sbit LCD_RW=P2^0;          //LCD读写控制
sbit LCD_RS=P2^1;          //LCD寄存器选择
sbit LCD_EN=P2^2;          //LCD使能信号


#endif