#ifndef __SMC1602_H__
#define __SMC1602_H__

#include <at89x51.h>


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<LCD设置函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
#define vdInitialize()	vWriteCMD(0x01);vWriteCMD(0x38);vWriteCMD(0x0C);		//初始化

//#define vdCleanLCD()	vWriteCMD(0x01);	  	//清屏

//#define vdSetShowMode()	vWriteCMD(0x38);		//显示模式设置：8位2行5x7点阵

//#define vdSetInput()	vWriteCMD(0x0C);		//文字不动，光标自动右移

	

//	vWriteCMD(0x0F);	   //显示器开、光标开、闪烁开

//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<端口设置宏定义>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
#define LCDRS P3_5								   //寄存器选择信号：
												   //		0--数据寄存器；
												   //		1--指令寄存器。

#define LCDRW P3_6								   //读写信号：
												   //		1--读LCD；
												   //		0--写LCD。

#define LCDE P3_7								   //片选信号，当输入下降沿信号时，
												   //执行指令或传送数据。

#define LCDPORT P0								   //LCD数据接口。

//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<写数据命令函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

void vDelay();									   //延时函数。

void vWriteCMD(unsigned char ucCommand);		   //把1个命令写入LCD。

void vWriteData(unsigned char ucData);			   //把1个数据写入LCD。


void vShowOneChar(unsigned char ucChar);

void vShowChar(unsigned char ucaChar[]);



#endif