//--------------------------------------------------------------------------//
//                                Ô´³ÌĞò´ó¹«¿ª                              //
//                    (c) Copyright 2001£­2005 xuwenjun                     //
//                            All Rights Reserved                           //
//                                    V1.00                                 //
//--------------------------------------------------------------------------//
//±ê¡¡Ìâ: P1¿ÚĞĞÁĞÊ½¼üÅÌ³ÌĞò                        ©                       //
//ÎÄ¼şÃû: xwj_hlkey.h                                                       //
//°æ¡¡±¾: V1.00                                                             //
//ĞŞ¸ÄÈË: ĞìÎÄ¾ü                         E-mail:xuwenjun@21cn.com           //
//ÈÕ¡¡ÆÚ: 05-05-13                                                          //
//Ãè¡¡Êö: P1¿ÚĞĞÁĞÊ½¼üÅÌ³ÌĞò                        ©                       //
//Éù¡¡Ã÷:                                                                   //
//        ÒÔÏÂ´úÂë½öÃâ·ÑÌá¹©¸øÑ§Ï°ÓÃÍ¾£¬µ«ÒıÓÃ»òĞŞ¸Äºó±ØĞëÔÚÎÄ¼şÖĞÉùÃ÷³ö´¦. //
//        ÈçÓÃÓÚÉÌÒµÓÃÍ¾ÇëÓë×÷ÕßÁªÏµ.    E-mail:xuwenjun@21cn.com           //
//        ÓĞÎÊÌâÇëmailto xuwenjun@21cn.com   »¶Ó­ÓëÎÒ½»Á÷!                  //
//--------------------------------------------------------------------------//
//ÀÏ°æ±¾: ÎŞ                             ÀÏ°æ±¾ÎÄ¼şÃû:                      //
//´´½¨ÈË: ĞìÎÄ¾ü                         E-mail:xuwenjun@21cn.com           //
//ÈÕ¡¡ÆÚ: 05-05-13                                                          //
//Ãè¡¡Êö:                                                                   //
//         CODE SIZE        =    396    ----                                //
//         CONSTANT SIZE    =     32    ----                                //
//         DATA SIZE        =      4       1                                //
//         BIT SIZE         =      2    ----                                //
//--------------------------------------------------------------------------//
	//  P1¿ÚĞĞÁĞÊ½¼üÅÌ  //
//unsigned char Keyscan(void);	//  ¼üÉ¨Ãèº¯Êı            //
unsigned char KeyGetCode(void);		//·µ»Ø°´¼üÂë
bit KeyTest(void);					//¼ì²éÓĞÎŞ°´¼ü,°üÀ¨Keyscan();

