//--------------------------------------------------------------------------//
//                                Ô´³ÌĞò´ó¹«¿ª                              //
//                    (c) Copyright 2001£­2005 xuwenjun                     //
//                            All Rights Reserved                           //
//                                    V1.00                                 //
//--------------------------------------------------------------------------//
//±ê¡¡Ìâ: ¶íÂŞË¹·½¿é³ÌĞò                            ©                       //
//ÎÄ¼şÃû: xwj_fk.h                                                          //
//°æ¡¡±¾: V1.00                                                             //
//ĞŞ¸ÄÈË: ĞìÎÄ¾ü                         E-mail:xuwenjun@21cn.com           //
//ÈÕ¡¡ÆÚ: 05-05-13                                                           //
//Ãè¡¡Êö: ¶íÂŞË¹·½¿é³ÌĞò                            ©                       //
//Éù¡¡Ã÷:                                                                   //
//        ÒÔÏÂ´úÂë½öÃâ·ÑÌá¹©¸øÑ§Ï°ÓÃÍ¾£¬µ«ÒıÓÃ»òĞŞ¸Äºó±ØĞëÔÚÎÄ¼şÖĞÉùÃ÷³ö´¦. //
//        ÈçÓÃÓÚÉÌÒµÓÃÍ¾ÇëÓë×÷ÕßÁªÏµ.    E-mail:xuwenjun@21cn.com           //
//        ÓĞÎÊÌâÇëmailto xuwenjun@21cn.com   »¶Ó­ÓëÎÒ½»Á÷!                  //
//--------------------------------------------------------------------------//
//ÀÏ°æ±¾: ÎŞ                             ÀÏ°æ±¾ÎÄ¼şÃû:                      //
//´´½¨ÈË: ĞìÎÄ¾ü                         E-mail:xuwenjun@21cn.com           //
//ÈÕ¡¡ÆÚ: 05-05-13                                                          //
//Ãè¡¡Êö:                                                                   //
//--------------------------------------------------------------------------//
void fk_init(void);						//·½¿é³õÊ¼»¯
void fk_move(void);						//ÒÆ¶¯·½¿é
extern bit fk_run;						//¶íÂŞË¹·½¿éÓÎÏ·ÔËĞĞ

